app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]
---
	<% end %>
	<% @current_user.posts.reverse.each do |post| %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
				<p class="post_content"><%= post.content %></p>
				<% post.comments.all.each do |comment| %>