app/views/home/globalcaws.html.erb

	<% end %>
	<% Post.all.reverse.each do |post| %>
---
SELECT "posts".* FROM "posts"

				<p class="post_content"><%= post.content %></p>
				<% post.comments.all.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]