app/views/home/home.html.erb

	<% end %>
	<% @current_user.followers_posts.reverse.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]

				<p class="post_content"><%= post.content %></p>
				<% post.comments.all.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]