app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "Welcome!"], ["created_at", "2016-02-11 03:50:33.720332"], ["updated_at", "2016-02-11 03:50:33.720332"]]
UPDATE "comments" SET "user_id" = ?, "post_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 2], ["post_id", 1], ["updated_at", "2016-02-11 03:50:33.724969"], ["id", 1]]
---
  def create
  	post_id = Post.find(params[:post_id])
  	c = Comment.create(params[:comment])
  	c.user_id = current_user.id
  	post_id.comments.push(c)