app/controllers/home_controller.rb

	def home
		current_user
		@comment = Comment.new
		@user = User.new
		@post = Post.new
		@current_user_followers = @current_user.followers_posts.reverse.each
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]