app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My First Post!"], ["content", "This is my first post!"], ["created_at", "2016-02-09 03:30:19.354071"], ["updated_at", "2016-02-09 03:30:19.354071"]]
UPDATE "posts" SET "user_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["user_id", 1], ["updated_at", "2016-02-09 03:30:19.359596"], ["id", 1]]
---
  def create
    new_post = Post.create(params[:post])
    current_user.posts.push(new_post)