app/controllers/profiles_controller.rb

	def update
		puts "***********************"
		puts current_user.profile
		puts "***********************"
		@update = params[:form_fields]
		@current_user.profile.update(@update)
---
UPDATE "profiles" SET "biography" = ?, "age" = ?, "location" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["biography", "Coding"], ["age", "25"], ["location", "Philadelphia"], ["updated_at", "2016-02-11 03:51:10.126797"], ["id", 2]]