app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["username", "AlanMRhode"]]
---
	def create
		puts params[:user]
		@user = User.where(username: params[:username]).first