app/controllers/users_controller.rb

INSERT INTO "users" ("username", "fname", "lname", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "profiles" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2016-02-09 03:29:36.073260"], ["updated_at", "2016-02-09 03:29:36.073260"]]
---
  def create
    # Take params from new.html.erb
  	@user = User.create(params[:user])
    # Create a profile for @new_user
    @profile = Profile.create(user_id: @user.id)